### 1.	Create a list of 5 integers. Perform and print the result of the following operations: append, extend, insert, remove, pop, clear, index, count, sort, and reverse.

In [2]:
lst1 = [1, 7, 13, 41, 53]

In [3]:
lst1.append(60) #add a single element at the end
lst1

[1, 7, 13, 41, 53, 60]

In [4]:
lst1.extend([71,23]) #add multiple elements at the end
lst1

[1, 7, 13, 41, 53, 60, 71, 23]

In [5]:
lst1.insert(3,13) #insert at a specific index
lst1

[1, 7, 13, 13, 41, 53, 60, 71, 23]

In [6]:
lst1.remove(60) #remove first occurrence of an element
lst1

[1, 7, 13, 13, 41, 53, 71, 23]

In [7]:
popped =lst1.pop(3) # Removes element at index 3
print(f"After pop(3): {lst1}, Popped Element: {popped}")

After pop(3): [1, 7, 13, 41, 53, 71, 23], Popped Element: 13

In [8]:
index_val =lst1.index(71) # find the index of an element
index_val

5

In [9]:
count_val = lst1.count(13)#count() - count occurrences of an element
count_val

1

In [10]:
lst1.sort()#sort the list in ascending order
lst1

[1, 7, 13, 23, 41, 53, 71]

In [11]:
lst1.reverse() #reverse the order of list
lst1

[71, 53, 41, 23, 13, 7, 1]

In [12]:
lst1.clear() #remove all elements
lst1

[]

### 2.	Create a tuple that stores 3 student names. Try changing the second name in the tuple. What happens? Explain why.

In [13]:
students = ("Alice", "Bob", "Charlie")

In [14]:
students[1] = "David"

TypeError: 'tuple' object does not support item assignment

## Explanation

###### 1.Tuples in Python are immutable, meaning once created, their elements cannot be changed, added, or removed.

2.That’s why trying to do students[1] = "David" gives a TypeError.

3.If you need a collection where elements can be changed, you should use a list instead of a tuple

### 3.	Create a set of integers with some duplicate values. Print the set and explain the output.

In [ ]:
numbers = {10, 20, 30, 20, 40, 10, 50}
print(f'Sets in Python do not allow duplicate values:{numbers}')

### 4.	Create a dictionary with the keys: 'name', 'age', and 'city'. Update the age and add a new key 'email'. Print the final dictionary.

In [15]:
person = {"name": "Alice","age": 25,"city": "New York"}
print(f'Original dictionary:{person}')

Original dictionary:{'name': 'Alice', 'age': 25, 'city': 'New York'}

In [16]:
person["age"]=26 #update the age
person

{'name': 'Alice', 'age': 26, 'city': 'New York'}

In [17]:
person["email"] = "alice@example.com" #Add a new key 'email'
print(f'Updated dictionary:{person}')

Updated dictionary:{'name': 'Alice', 'age': 26, 'city': 'New York', 'email': 'alice@example.com'}

### Write a script that checks if a person is eligible to vote (age ≥ 18). Take age as a variable and print the appropriate message.

In [19]:
age = int(input("Enter your age: "))
if age >= 18:
    print("You are eligible to vote")
else:
    print("You are not eligible to vote")

Enter your age:  12

You are not eligible to vote

### 6.	Given a 'marks' variable, print the grade:
- 90 and above: 'A'
- 75–89: 'B'
- 50–74: 'C'
- Below 50: 'Fail'

In [69]:
marks = int(input("Give any marks: "))

# Check grade
if marks >= 90:
    print("Grade: A")
elif marks >= 75:
    print("Grade: B")
elif marks >= 50:
    print("Grade: C")
else:
    print("Grade: Fail")

Give any marks:  57

Grade: C

### 7.	Given a number, check if it's positive, and if it is also even. If not positive, print if it's zero or negative.

In [70]:
def zero_or_nagative(num):
    if num > 0:
        print("The number is positive.")
        if num % 2 == 0:
            print("It is also even.")
        else:
            print("It is odd.")
    elif num == 0:
        print("The number is zero.")
    else:
        print("The number is negative.")

In [72]:
num = int(input("Enter a number: "))
zero_or_nagative(num)

Enter a number:  -3

The number is negative.

### 8.	Create:
- A scalar using np.array(5)
- A 1D array with values 1 to 5
- A 2D array (2x3) with values from 10 to 60 in steps of 10

In [20]:
import numpy as np

In [21]:
scalar = np.array(5)
scalar

array(5)

In [22]:
one_d_array = np.array([1, 2, 3, 4, 5])#1D array with values 1 to 5
one_d_array

array([1, 2, 3, 4, 5])

In [23]:
two_d_array= np.array([[11, 22, 33],
                  [44, 54, 64]])
two_d_array #2D array (2x3) with values 10 to 60 in steps of 10

array([[11, 22, 33],
       [44, 54, 64]])

### 9.	Generate a 4x4 Numpy array of random integers between 0 and 100 using np.random.randint().

In [24]:
arr = np.random.randint(0, 101, size=(4, 4))
arr

array([[95, 26, 91, 59],
       [19, 92,  1, 90],
       [56, 86, 60, 74],
       [87, 35, 97, 49]], dtype=int32)

### 10.	Create a 2D numpy array of shape (3x3). Convert it into a pandas DataFrame and add column names: 'A', 'B', 'C'.

In [25]:
import pandas as pd

In [26]:
arr1=arr[:3,:3]
arr1

array([[95, 26, 91],
       [19, 92,  1],
       [56, 86, 60]], dtype=int32)

In [27]:
df = pd.DataFrame(arr1, columns=['A', 'B', 'C'])
df

    A   B   C
0  95  26  91
1  19  92   1
2  56  86  60

### Section C: Exploring Pandas

#### 1. Create a small DataFrame manually with 10 rows and columns: 'Name', 'Age', 'City', and 'Salary'. Then:


- Use .info(), .describe()
- Select 'Name' and 'City' columns
- Drop 'City' column
- Fill any missing values in 'Salary' column with the mean
- Remove any duplicate rows

In [76]:
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'David', 'Hannah', 'Ian', 'Jack'],
    'Age': [25, 30, 35, 40, 28, 32, 40, 27, 29, 35],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston', 'Miami', 'Chicago', 'Miami', 'New York', 'Houston', 'Miami'],
    'Salary': [50000, 60000, 55000, None, 48000, 60000, None, None, 52000, 48000]
}

In [77]:
df = pd.DataFrame(data)
df

      Name  Age         City   Salary
0    Alice   25     New York  50000.0
1      Bob   30  Los Angeles  60000.0
2  Charlie   35      Chicago  55000.0
3    David   40      Houston      NaN
4      Eva   28        Miami  48000.0
5    Frank   32      Chicago  60000.0
6    David   40        Miami      NaN
7   Hannah   27     New York      NaN
8      Ian   29      Houston  52000.0
9     Jack   35        Miami  48000.0

In [78]:
df.shape

(10, 4)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Age     10 non-null     int64
 2   City    10 non-null     object
 3   Salary  7 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 452.0+ bytes

In [80]:
df.describe()

             Age        Salary
count  10.000000      7.000000
mean   32.100000  53285.714286
std     5.258855   5186.980037
min    25.000000  48000.000000
25%    28.250000  49000.000000
50%    31.000000  52000.000000
75%    35.000000  57500.000000
max    40.000000  60000.000000

In [81]:
df[['Name', 'City']]

      Name         City
0    Alice     New York
1      Bob  Los Angeles
2  Charlie      Chicago
3    David      Houston
4      Eva        Miami
5    Frank      Chicago
6    David        Miami
7   Hannah     New York
8      Ian      Houston
9     Jack        Miami

In [82]:
df_dropped = df.drop(columns=['City'] ,inplace=True)
df_dropped

In [83]:
mean_salary = df['Salary'].mean()
mean_salary

np.float64(53285.71428571428)

In [90]:
import warnings
warnings.filterwarnings('ignore')
df['Salary'] =df['Salary'].fillna(mean_salary)
df

      Name  Age        Salary
0    Alice   25  53285.714286
1      Bob   30  53285.714286
2  Charlie   35  53285.714286
3    David   40  53285.714286
4      Eva   28  53285.714286
5    Frank   32  53285.714286
6    David   40  53285.714286
7   Hannah   27  53285.714286
8      Ian   29  53285.714286
9     Jack   35  53285.714286

In [91]:
df.duplicated().sum()

np.int64(1)

In [92]:
df_no_duplicates = df.drop_duplicates()
df_no_duplicates

      Name  Age        Salary
0    Alice   25  53285.714286
1      Bob   30  53285.714286
2  Charlie   35  53285.714286
3    David   40  53285.714286
4      Eva   28  53285.714286
5    Frank   32  53285.714286
7   Hannah   27  53285.714286
8      Ian   29  53285.714286
9     Jack   35  53285.714286

In [93]:
df_no_duplicates.reset_index(drop=True)

      Name  Age        Salary
0    Alice   25  53285.714286
1      Bob   30  53285.714286
2  Charlie   35  53285.714286
3    David   40  53285.714286
4      Eva   28  53285.714286
5    Frank   32  53285.714286
6   Hannah   27  53285.714286
7      Ian   29  53285.714286
8     Jack   35  53285.714286